SxLiuYu/esp32-tablet/sdkconfig.defaults.bak
CONFIG_ESPTOOLPY_PORT="/dev/tty.usbserial-*"
CONFIG_ESPTOOLPY_BAUD_921600B=y
CONFIG_IDF_TARGET="esp32"
CONFIG_IDF_TARGET_ESP32=y
CONFIG_ESP32_REV_MIN_1=y
CONFIG_ESP32_DEFAULT_CPU_FREQ_160MHZ=y
CONFIG_ESP32_SPIRAM_SUPPORT=n
CONFIG_ESP32_PARTITION_TABLE_CUSTOM=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LVGL_TFT_DISPLAY_SWAP_XY=y
CONFIG_LVGL_TFT_DISPLAY_MIRROR_X=y
CONFIG_LVGL_TFT_DISPLAY_MIRROR_Y=y
CONFIG_LVGL_FB_IN_PSRAM=n
CONFIG_LVGL_COLOR_DEPTH_16=y
CONFIG_LVGL_TASK_STACK_SIZE 4096
CONFIG_LVGL_TICK_PERIOD_MS 5
CONFIG_ESP_WEBSOCKET_URI="ws://192.168.1.10:7103/ws/audio"
CONFIG_ESP_NETIF_STACK_SIZE 4096
CONFIG_ESP_SYSTEM_EVENT_QUEUE_SIZE 32
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE 4096
CONFIG_WIFI_TASK_STACK_SIZE 4096
CONFIG_ESP32_WIFI_STATIC_TX_BUFFER=n
CONFIG_ESP32_WIFI_DYNAMIC_TX_BUFFER=y
CONFIG_ESP32_WIFI_TX_BA_WIN=3
CONFIG_ESP32_WIFI_RX_BA_WIN=3
CONFIG_ESP32_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP32_WIFI_AMPDU_RX_ENABLED=n
CONFIG_ESP_LCD_ST7789_SWAP_XY=y
CONFIG_ESP_LCD_ST7789_MIRROR_X=y
CONFIG_ESP_LCD_ST7789_MIRROR_Y=y
CONFIG_SDCARD_FS_INCLUDE_VFS=y
CONFIG_ESP_ERR_TO_NAME_LOOKUP=n
CONFIG_ESP_TASK_WDT=n
CONFIG_ESP_SYSTEM_CHECK=n
CONFIG_ESP_LCD_RGB_USING_RMT=y
CONFIG_RMT_TX_CHANNEL_AUTO_CLEAR=y
CONFIG_RMT_TX_LOOP=n
CONFIG_I2S_NUM_0_USE_SUBSYS=y
CONFIG_I2S_TX_FIFO_MOD=y
CONFIG_I2S_TX_FIFO_MOD_MODEM_SPDIF=y
CONFIG_I2S_TX_PDM_LSB_FIRST=y
CONFIG_ADC_DISABLE_DAC=y
CONFIG_ESP32S2_SPECIFIC=n